tutorials/tested/reactingRect2D/reactingRect2D_Pimple/0.org/TSolid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 433.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 433.0;
    }
    "(outlet|sides)"
    {
        type            zeroGradient;
    }
        frontAndBack
    {
        type            empty;
    }
        "sym"
    {
        type        symmetry;
    }
}
